test/exam-enter-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="1000学生1分钟进入考试ID=7">
      <stringProp name="TestPlan.comments">1000名学生（student4到student1003）在1分钟内登录并进入考试ID=7</stringProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments">
        <collectionProp name="Arguments.arguments">
          <elementProp name="baseUrl" elementType="Argument">
            <stringProp name="Argument.name">baseUrl</stringProp>
            <stringProp name="Argument.value">http://localhost:8080</stringProp>
          </elementProp>
          <elementProp name="loginPath" elementType="Argument">
            <stringProp name="Argument.name">loginPath</stringProp>
            <stringProp name="Argument.value">/api/auth/login</stringProp>
          </elementProp>
          <elementProp name="enterExamPath" elementType="Argument">
            <stringProp name="Argument.name">enterExamPath</stringProp>
            <stringProp name="Argument.value">/api/student/exams/${examId}/enter</stringProp>
          </elementProp>
          <elementProp name="password" elementType="Argument">
            <stringProp name="Argument.name">password</stringProp>
            <stringProp name="Argument.value">student123</stringProp>
          </elementProp>
          <elementProp name="userPrefix" elementType="Argument">
            <stringProp name="Argument.name">userPrefix</stringProp>
            <stringProp name="Argument.value">student</stringProp>
          </elementProp>
          <elementProp name="startIndex" elementType="Argument">
            <stringProp name="Argument.name">startIndex</stringProp>
            <stringProp name="Argument.value">4</stringProp>
          </elementProp>
          <elementProp name="userCount" elementType="Argument">
            <stringProp name="Argument.name">userCount</stringProp>
            <stringProp name="Argument.value">1000</stringProp>
          </elementProp>
          <elementProp name="examId" elementType="Argument">
            <stringProp name="Argument.name">examId</stringProp>
            <stringProp name="Argument.value">7</stringProp>
          </elementProp>
          <elementProp name="rampUpSeconds" elementType="Argument">
            <stringProp name="Argument.name">rampUpSeconds</stringProp>
            <stringProp name="Argument.value">60</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
    </TestPlan>
    <hashTree>
      <!-- HTTP默认配置 -->
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP默认配置">
        <stringProp name="HTTPSampler.domain">localhost</stringProp>
        <stringProp name="HTTPSampler.port">8080</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
        <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
      </ConfigTestElement>
      <hashTree/>

      <!-- HTTP头管理器 -->
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP头管理器">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="Content-Type" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>

      <!-- Cookie管理器 -->
      <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="Cookie管理器"/>
      <hashTree/>

      <!-- 主线程组：登录并进入考试 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="登录并进入考试">
        <stringProp name="ThreadGroup.num_threads">${userCount}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${rampUpSeconds}</stringProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <!-- 生成正确的用户名 -->
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="生成用户名(student4到student1003)">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script"><![CDATA[
// 计算用户名：student4 到 student1003
int startIndex = Integer.parseInt(vars.get("startIndex"));  // 4
int threadNum = ctx.getThreadNum();  // 0-999
int studentNumber = startIndex + threadNum;  // 4-1003

String username = vars.get("userPrefix") + studentNumber;
vars.put("username", username);
vars.put("studentNumber", String.valueOf(studentNumber));

// 调试信息
log.info("线程 " + threadNum + " -> 用户名: " + username);
]]></stringProp>
        </JSR223PreProcessor>
        <hashTree/>

        <!-- 登录请求 -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="学生登录">
          <stringProp name="HTTPSampler.path">${loginPath}</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;username&quot;:&quot;${username}&quot;,&quot;userpassword&quot;:&quot;${password}&quot;}</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <!-- 提取登录token和userId -->
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="提取登录信息">
            <stringProp name="JSONPostProcessor.referenceNames">authToken,studentId</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.data.token,$.data.userId</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">-1,-1</stringProp>
          </JSONPostProcessor>
          <hashTree/>

          <!-- 验证登录成功 -->
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="验证登录成功">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49561">2</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>

          <!-- 检查token是否获取成功 -->
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="检查token">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="script"><![CDATA[
String token = vars.get("authToken");
if (token == null || token.isEmpty()) {
    Failure = true;
    FailureMessage = "登录失败：未获取到token，响应：" + prev.getResponseDataAsString();
    log.error("用户 " + vars.get("username") + " 登录失败");
}
]]></stringProp>
          </JSR223Assertion>
          <hashTree/>
        </hashTree>

        <!-- 添加认证头 -->
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="添加认证头">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="Authorization" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer ${authToken}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>

        <!-- 进入考试请求 -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="进入考试ID=7">
          <stringProp name="HTTPSampler.path">${enterExamPath}</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;studentId&quot;:${studentId}}</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <!-- 提取考试token（如果需要） -->
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="提取考试token">
            <stringProp name="JSONPostProcessor.referenceNames">examToken</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.data.token</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">-1</stringProp>
          </JSONPostProcessor>
          <hashTree/>

          <!-- 验证进入考试成功 -->
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="验证进入考试成功">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49561">2</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>

          <!-- 记录成功信息 -->
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="记录成功">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="script"><![CDATA[
String username = vars.get("username");
String studentId = vars.get("studentId");
boolean success = prev.isSuccessful();

if (success) {
    log.info("✓ 学生 " + username + " (ID:" + studentId + ") 成功进入考试ID=7");
    vars.put("examStatus", "SUCCESS");
} else {
    log.error("✗ 学生 " + username + " 进入考试失败");
    vars.put("examStatus", "FAILED");
}
]]></stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>

        <!-- 添加思考时间（可选，模拟学生操作） -->
        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="思考时间">
          <stringProp name="ConstantTimer.delay">100</stringProp>
        </ConstantTimer>
        <hashTree/>
      </hashTree>

      <!-- 结果收集器 -->
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="汇总报告">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>

      <!-- 聚合报告 -->
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="聚合报告">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>